app/controllers/messages_controller.rb

  def index
    @messages = Message.all
---
SELECT `messages`.* FROM `messages`

  def show
    @message = Message.find(params[:id])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 1 LIMIT 1

  def new
    @message = Message.new
	  @messages = Message.all
---
SELECT `messages`.* FROM `messages`

  def create
  	@message = Message.create!(params[:message])
---
INSERT INTO `messages` (`content`, `created_at`, `updated_at`) VALUES ('', '2011-08-21 03:42:50', '2011-08-21 03:42:50')

  def edit
    @message = Message.find(params[:id])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 2 LIMIT 1

  def update
    @message = Message.find(params[:id])
    if @message.update_attributes(params[:message])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = 2 LIMIT 1
UPDATE `messages` SET `content` = '鹅鹅鹅分v', `updated_at` = '2011-08-21 04:31:15' WHERE `messages`.`id` = 2